#ゲーム内定数
SCREEN_WIDTH = 1024 #1024、800
SCREEN_HEIGHT = 768 #768、600
FPS = 60
BGM_VOLUME = 0.3
SE_VOLUME = 0.3

#色
BG_COLOR = (0, 0, 0) #Background
T_COLOR = (255, 255, 255) #Text
A_COLOR = (255, 51, 51) #Arrow

#名称
TITLE_NAME = "UnsealEscape"

#文章
PROLOGUE_TEXT = (
    "今話題になっている\"とある悪魔\"を召喚する儀式。\n"
    "\n"
    "私は興味を持ち、\n"
    "\n"
    "山奥にある古い屋敷に行き\n"
    "\n"
    "儀式を行うことにした・・・"
)
STORY_TEXT = (
    "リリー：「……本当に、こんなオカルトじみた儀式で悪魔なんて現れるのかしら。」",
    "古びた書物に書かれていた通りに、怪しげな呪文を声に出して唱えてみる。\n部屋にはただ冷たい静寂が広がるだけだった。",
    "リリー：「ふぅ……やっぱりネットの噂なんて、ただの嘘に決まってるわよね。バカバカしい。」",
    "諦めて帰ろうと荷物に手を伸ばした、その瞬間――",
    "部屋の温度が、一気に氷点下まで下がったかのような錯覚に襲われる。\n心臓を直接掴まれたような、圧倒的な「恐怖」の気配。",
    "――ギチ、ギチギチギチッ！！",
    "古い屋敷の奥から流れる赤い光が狂ったように明滅し、\n歪んだ空間から、この世のモノとは思えない『何か』が這い出てきた。",
    "リリー：「うそ……あ、悪魔……！？ 本当に出るなんて……いや、嫌ぁっ！！」",
    "本能的な恐怖に突き動かされ、私は狂ったように入り口の扉へと駆け寄った。",
    "ガシャガシャガシャッ！！！",
    "リリー：「開かない……！？ どうして、鍵なんて掛かっていないはずなのに……開いてよ、お願いだからっ！！」",
    "背後から、冷酷で禍々しい視線がじっと私を突き刺しているのを感じた――。"
)